; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	infrared1 - mode
	thermograph2 - mode
	thermograph0 - mode
	Star0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star4 - direction
	Star6 - direction
	Star3 - direction
	Star5 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Planet15 - direction
	Star16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet15)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star14)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star5)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
)
(:goal (and
	(pointing satellite1 Planet15)
	(have_image Phenomenon7 thermograph0)
	(have_image Phenomenon8 thermograph2)
	(have_image Planet9 thermograph0)
	(have_image Phenomenon10 infrared1)
	(have_image Planet11 thermograph2)
	(have_image Planet12 thermograph2)
	(have_image Phenomenon13 infrared1)
	(have_image Star14 thermograph2)
	(have_image Planet15 thermograph0)
	(have_image Star16 thermograph2)
	(have_image Phenomenon17 thermograph0)
))

)

; plan
1. (turn_to satellite1 star3 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star3)
   goals met: 0 of 12
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 12
3. (calibrate satellite1 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 0 of 12
4. (turn_to satellite1 phenomenon13 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon13)
   goals met: 0 of 12
5. (take_image satellite1 phenomenon13 instrument1 infrared1)
   added: (have_image phenomenon13 infrared1)
   goals met: 1 of 12
6. (turn_to satellite1 phenomenon10 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon10)
   goals met: 1 of 12
7. (turn_to satellite0 star3 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star3)
   goals met: 1 of 12
8. (take_image satellite1 phenomenon10 instrument1 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 2 of 12
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 12
10. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 2 of 12
11. (turn_to satellite0 phenomenon8 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 12
12. (take_image satellite0 phenomenon8 instrument0 thermograph2)
   added: (have_image phenomenon8 thermograph2)
   goals met: 3 of 12
13. (turn_to satellite0 planet11 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet11)
   goals met: 3 of 12
14. (take_image satellite0 planet11 instrument0 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 4 of 12
15. (turn_to satellite0 planet12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet12)
   goals met: 4 of 12
16. (take_image satellite0 planet12 instrument0 thermograph2)
   added: (have_image planet12 thermograph2)
   goals met: 5 of 12
17. (turn_to satellite0 star14 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star14)
   goals met: 5 of 12
18. (take_image satellite0 star14 instrument0 thermograph2)
   added: (have_image star14 thermograph2)
   goals met: 6 of 12
19. (turn_to satellite0 star16 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star16)
   goals met: 6 of 12
20. (take_image satellite0 star16 instrument0 thermograph2)
   added: (have_image star16 thermograph2)
   goals met: 7 of 12
21. (turn_to satellite1 phenomenon17 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon17)
   goals met: 7 of 12
22. (take_image satellite1 phenomenon17 instrument1 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 8 of 12
23. (turn_to satellite1 phenomenon7 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon7)
   goals met: 8 of 12
24. (take_image satellite1 phenomenon7 instrument1 thermograph0)
   added: (have_image phenomenon7 thermograph0)
   goals met: 9 of 12
25. (turn_to satellite1 planet9 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet9)
   goals met: 9 of 12
26. (take_image satellite1 planet9 instrument1 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 10 of 12
27. (turn_to satellite1 planet15 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 planet15)
   goals met: 11 of 12
28. (take_image satellite1 planet15 instrument1 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 12 of 12
